      google.charts.load('current', {
        'packages': ['sankey']
      });
      google.charts.setOnLoadCallback(drawChart);

      function drawChart() {
        var data = new google.visualization.DataTable();
        data.addColumn('string', 'From');
        data.addColumn('string', 'To');
        data.addColumn('number', 'Weight');
        data.addRows([
          ['정보통신', '김연아', 24],
          ['전기전자', '김연아', 50],
          ['자동차/정유', '김연아', 13],
          ['음료/기호식품', '김연아', 31],
          ['식품/제과', '김연아', 5],
          ['생활/가정용품', '김연아', 15],
          ['화장품', '김연아', 12],
          ['패션/스포츠', '김연아', 27],
          ['금융/보험', '김연아', 29],
          ['출판/교육/문화', '김연아', 49],
          ['서비스/유통/레저', '김연아', 4],
          ['관공서/단체/공익/기업PR', '김연아', 5],
          ['정보통신', '전지현', 51],
          ['전기전자', '전지현', 17],
          ['자동차/정유', '전지현', 3],
          ['음료/기호식품', '전지현', 28],
          ['식품/제과', '전지현', 28],
          ['생활/가정용품', '전지현', 4],
          ['화장품', '전지현', 59],
          ['패션/스포츠', '전지현', 42],
          ['제약/의료/복지', '전지현', 8],
          ['금융/보험', '전지현', 3],
          ['아파트/건설', '전지현', 1],
          ['출판/교육/문화', '전지현', 11],
          ['서비스/유통/레저', '전지현', 5],
          ['관공서/단체/공익/기업PR', '전지현', 1],
          ['정보통신', '소녀시대', 34],
          ['전기전자', '소녀시대', 28],
          ['자동차/정유', '소녀시대', 4],
          ['음료/기호식품', '소녀시대', 15],
          ['식품/제과', '소녀시대', 20],
          ['생활/가정용품', '소녀시대', 9],
          ['화장품', '소녀시대', 75],
          ['패션/스포츠', '소녀시대', 14],
          ['제약/의료/복지', '소녀시대', 13],
          ['금융/보험', '소녀시대', 3],
          ['출판/교육/문화', '소녀시대', 15],
          ['서비스/유통/레저', '소녀시대', 9],
          ['관공서/단체/공익/기업PR', '소녀시대', 4],
          ['정보통신', '이나영', 18],
          ['전기전자', '이나영', 27],
          ['자동차/정유', '이나영', 8],
          ['음료/기호식품', '이나영', 34],
          ['식품/제과', '이나영', 11],
          ['생활/가정용품', '이나영', 9],
          ['화장품', '이나영', 50],
          ['패션/스포츠', '이나영', 24],
          ['금융/보험', '이나영', 14],
          ['아파트/건설', '이나영', 11],
          ['출판/교육/문화', '이나영', 6],
          ['서비스/유통/레저', '이나영', 9],
          ['정보통신', '김태희', 39],
          ['전기전자', '김태희', 35],
          ['자동차/정유', '김태희', 13],
          ['음료/기호식품', '김태희', 33],
          ['식품/제과', '김태희', 9],
          ['생활/가정용품', '김태희', 11],
          ['화장품', '김태희', 40],
          ['패션/스포츠', '김태희', 1],
          ['금융/보험', '김태희', 17],
          ['아파트/건설', '김태희', 12],
          ['출판/교육/문화', '김태희', 3],
          ['서비스/유통/레저', '김태희', 6],
          ['관공서/단체/공익/기업PR', '김태희', 5]
        ]);

        // Sets chart options.
        var options = {
          height: 700,
          width: 1110
        };

        // Instantiates and draws our chart, passing in some options.
        var chart = new google.visualization.Sankey(document.getElementById('sankey_basic'));
        chart.draw(data, options);
      }